RT-Thread/rt-thread/bsp/wch/arm/Libraries/CH32F10x_StdPeriph_Driver/StdPeriph_Driver/src/ch32f10x_usb.c
/*******************************************************************************
* Function Name  : CtrlSetUsbAddress
* Description    : Set USB device address.
* Input          : addr: Device address.
* Return         : ERR_SUCCESS   
*******************************************************************************/
UINT8 CtrlSetUsbAddress( UINT8 addr ) 
{
	UINT8   s;

	CopySetupReqPkg( SetupSetUsbAddr );	
	pSetupReq -> wValue = addr;                                      
	s = HostCtrlTransfer( NULL, NULL );                            
	if ( s != ERR_SUCCESS ) return( s );
	SetHostUsbAddr( addr );                                                
	mDelaymS( 10 );   
	
	return( ERR_SUCCESS );
}

/*******************************************************************************
* Function Name  : CtrlSetUsbConfig
* Description    : Set usb configration.
* Input          : cfg: Configration Value.
* Return         : ERR_SUCCESS 
*******************************************************************************/
UINT8 CtrlSetUsbConfig( UINT8 cfg )                   
{
	CopySetupReqPkg( SetupSetUsbConfig );	
	pSetupReq -> wValue = cfg;                       
	return( HostCtrlTransfer( NULL, NULL ) );                      
}

/*******************************************************************************
* Function Name  : CtrlClearEndpStall
* Description    : Clear endpoint STALL.
* Input          : endp: Endpoint address.
* Return         : ERR_SUCCESS    
*******************************************************************************/
UINT8 CtrlClearEndpStall( UINT8 endp )  
{
	CopySetupReqPkg( SetupClrEndpStall );                        
	pSetupReq -> wIndex = endp;                                  
	return( HostCtrlTransfer( NULL, NULL ) );                      
}

/*******************************************************************************
* Function Name  : CtrlSetUsbIntercace
* Description    : Set USB Interface configration.
* Input          : cfg: Configration value.
* Return         : ERR_SUCCESS    
*******************************************************************************/
UINT8 CtrlSetUsbIntercace( UINT8 cfg )                   
{
	CopySetupReqPkg( SetupSetUsbInterface );		
	pSetupReq -> wValue = cfg;                         
	return( HostCtrlTransfer( NULL, NULL ) );               
}

/*******************************************************************************
* Function Name  : USB_HostInit
* Description    : Initializes USB host mode.
* Input          : None			   				
* Return         : None
*******************************************************************************/
void  USB_HostInit( void )
{	
	R8_USB_CTRL = RB_UC_HOST_MODE; 
	R8_UHOST_CTRL = 0;                           
	R8_USB_DEV_AD = 0x00;
	EXTEN_CTRL = USBHD_IO_EN|USBD_LOWSPEED|USBD_PU_EN;//| USB_5V_SEL; 
	R8_UH_EP_MOD = RB_UH_EP_TX_EN | RB_UH_EP_RX_EN;
	R16_UH_RX_DMA = (UINT16)(UINT32)pHOST_RX_RAM_Addr;
	R16_UH_TX_DMA = (UINT16)(UINT32)pHOST_TX_RAM_Addr;

	R8_UH_RX_CTRL = 0x00;
	R8_UH_TX_CTRL = 0x00;
	R8_USB_CTRL =  RB_UC_HOST_MODE | RB_UC_INT_BUSY | RB_UC_DMA_EN;
	R8_UH_SETUP = RB_UH_SOF_EN;	
	R8_USB_INT_FG = 0xFF;
	DisableRootHubPort( );
	R8_USB_INT_EN = RB_UIE_TRANSFER|RB_UIE_DETECT;	

	FoundNewDev = 0;
}

/*****************************************************************************
* Function Name  : InitRootDevice
* Description    : Initializes USB root hub.
* Input          : DataBuf: Data buffer.
* Return         : ERROR
*******************************************************************************/
UINT8 InitRootDevice( PUINT8 DataBuf ) 
{
	UINT8  i, s;
	UINT8  cfg, dv_cls, if_cls;

	PRINT( "Reset host port\n" );
	ResetRootHubPort( );  
	
	for ( i = 0, s = 0; i < 100; i ++ ) 
	{  				
		mDelaymS( 1 );
		if ( EnableRootHubPort( ) == ERR_SUCCESS ) {  
				i = 0;
				s ++;  					
				if ( s > 100 ) break;  	
		}
	}
	
	if ( i ) 
	{  										
		DisableRootHubPort( );
		PRINT( "Disable host port because of disconnect\n" );
		return( ERR_USB_DISCON );
	}
	
	SetUsbSpeed( ThisUsbDev.DeviceSpeed );  

	PRINT( "GetDevDescr: " );
	s = CtrlGetDeviceDescr( DataBuf );  
	
	if ( s == ERR_SUCCESS )
	{
		for ( i = 0; i < ((PUSB_SETUP_REQ)SetupGetDevDescr)->wLength; i ++ ) 		
		PRINT( "x%02X ", (UINT16)( DataBuf[i] ) );
	  PRINT( "\n" ); 

		ThisUsbDev.DeviceVID = ((PUSB_DEV_DESCR)DataBuf)->idVendor; 
		ThisUsbDev.DevicePID = ((PUSB_DEV_DESCR)DataBuf)->idProduct;
		dv_cls = ( (PUSB_DEV_DESCR)DataBuf ) -> bDeviceClass;

		s = CtrlSetUsbAddress( ((PUSB_SETUP_REQ)SetupSetUsbAddr)->wValue );  
		
		if ( s == ERR_SUCCESS )
		{
			ThisUsbDev.DeviceAddress = ( (PUSB_SETUP_REQ)SetupSetUsbAddr )->wValue;  

			PRINT( "GetCfgDescr: " );
		  s = CtrlGetConfigDescr( DataBuf );
			
			if ( s == ERR_SUCCESS ) 
			{
			  for ( i = 0; i < ( (PUSB_CFG_DESCR)DataBuf )->wTotalLength; i ++ ) 
				PRINT( "x%02X ", (UINT16)( DataBuf[i] ) );
				PRINT("\n");			
				cfg = ( (PUSB_CFG_DESCR)DataBuf )->bConfigurationValue;
			  if_cls = ( (PUSB_CFG_DESCR_LONG)DataBuf )->itf_descr.bInterfaceClass;  
														
			  if ( (dv_cls == 0x00) && (if_cls == USB_DEV_CLASS_STORAGE)) {  
					
	#ifdef	FOR_ROOT_UDISK_ONLY
					 CH579DiskStatus = DISK_USB_ADDR;
					 return( ERR_SUCCESS );
				}
			  else 	return( ERR_USB_UNSUPPORT );
				
	#else
				s = CtrlSetUsbConfig( cfg ); 
				
				if ( s == ERR_SUCCESS )
			  {
					ThisUsbDev.DeviceStatus = ROOT_DEV_SUCCESS;
					ThisUsbDev.DeviceType = USB_DEV_CLASS_STORAGE;
					PRINT( "USB-Disk Ready\n" );
					SetUsbSpeed( 1 );  
					return( ERR_SUCCESS );
			  }
			}
		  else if ( (dv_cls == 0x00) && (if_cls == USB_DEV_CLASS_PRINTER) && ((PUSB_CFG_DESCR_LONG)DataBuf)->itf_descr.bInterfaceSubClass == 0x01 ) {  
			  s = CtrlSetUsbConfig( cfg ); 
				if ( s == ERR_SUCCESS ) {
					ThisUsbDev.DeviceStatus = ROOT_DEV_SUCCESS;
					ThisUsbDev.DeviceType = USB_DEV_CLASS_PRINTER;
					PRINT( "USB-Print Ready\n" );
					SetUsbSpeed( 1 );    
					return( ERR_SUCCESS );
				}
			}
		  else if ( (dv_cls == 0x00) && (if_cls == USB_DEV_CLASS_HID) && ((PUSB_CFG_DESCR_LONG)DataBuf)->itf_descr.bInterfaceSubClass <= 0x01 ) {  
				if_cls = ( (PUSB_CFG_DESCR_LONG)DataBuf ) -> itf_descr.bInterfaceProtocol;
			  s = CtrlSetUsbConfig( cfg ); 
				if ( s == ERR_SUCCESS ) {
					ThisUsbDev.DeviceStatus = ROOT_DEV_SUCCESS;
					if ( if_cls == 1 ) {
						ThisUsbDev.DeviceType = DEV_TYPE_KEYBOARD;
						PRINT( "USB-Keyboard Ready\n" );
					  SetUsbSpeed( 1 );  
						return( ERR_SUCCESS );
					}
				  else if ( if_cls == 2 ) {
						ThisUsbDev.DeviceType = DEV_TYPE_MOUSE;
						PRINT( "USB-Mouse Ready\n" );
						SetUsbSpeed( 1 );  
					  return( ERR_SUCCESS );
				  }
				  s = ERR_USB_UNSUPPORT;
			  }
			}
			else {   
				s = CtrlSetUsbConfig( cfg );  
				if ( s == ERR_SUCCESS ) {
					ThisUsbDev.DeviceStatus = ROOT_DEV_SUCCESS;
					ThisUsbDev.DeviceType = DEV_TYPE_UNKNOW;
					SetUsbSpeed( 1 );  
				  return( ERR_SUCCESS );  
			  }
			}
			
	#endif			
		  }
		}
	}

	PRINT( "InitRootDev Err = %02X\n", (UINT16)s );
	
#ifdef	FOR_ROOT_UDISK_ONLY
	CH579DiskStatus = DISK_CONNECT;
	
#else
	ThisUsbDev.DeviceStatus = ROOT_DEV_FAILED;
	
#endif
	
	SetUsbSpeed( 1 );  
	
	return( s );		
}













